---
kind: property
id: P:Autodesk.Revit.DB.NestedFamilyTypeReference.TypeName
source: html/76e74eb3-5217-5f99-f781-ef29996eea85.htm
---
# Autodesk.Revit.DB.NestedFamilyTypeReference.TypeName Property

Type of the referenced family

## Syntax (C#)
```csharp
public string TypeName { get; }
```